RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_02.svd
          <register>
            <name>PSTATE_REG</name>
            <description>Present State Register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1BFF0FF7</resetMask>
            <fields>
              <field>
                <name>CMD_INHIBIT</name>
                <description>Command Inhibit (CMD)
This bit indicates the following :
- SD/eMMC mode: If this bit is set to 0, it indicates that the
CMD line is not in use and the Host controller can issue
an SD/eMMC command using the CMD line. This bit is
set when the command register is written. This bit is
cleared when the command response is received. This bit
is not cleared by the response of auto CMD12/23 but
cleared by the response of read/write command.
Values:
- 0x0 (READY): Host Controller is ready to issue a
command
- 0x1 (NOT_READY): Host Controller is not ready to issue
a command</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_INHIBIT_DAT</name>
                <description>Command Inhibit (DAT)
This bit is applicable for SD/eMMC mode and is generated if
either DAT line active or Read transfer active is set to 1. If
this bit is set to 0, it indicates that the Host Controller can
issue subsequent SD/eMMC commands.
Values:
- 0x0 (READY): Can issue command which used DAT line
- 0x1 (NOT_READY): Cannot issue command which used
DAT line</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DAT_LINE_ACTIVE</name>
                <description>DAT Line Active (SD/eMMC Mode only)
This bit indicates whether one of the DAT lines on the
SD/eMMC bus is in use.
In the case of read transactions, this bit indicates whether a
read transfer is executing on the SD/eMMC bus.
In the case of write transactions, this bit indicates whether a
write transfer is executing on the SD/eMMC bus.
For a command with busy, this status indicates whether the
command executing busy is executing on an SD or eMMC
bus.
Values:
- 0x0 (INACTIVE): DAT Line Inactive
- 0x1 (ACTIVE): DAT Line Active</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DAT_7_4</name>
                <description>DAT[7:4] Line Signal Level
This bit is used to check the DAT line level to recover from
errors and for debugging. These bits reflect the value of the
sd_dat_in (upper nibble) signal.</description>
                <bitRange>[7:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_XFER_ACTIVE</name>
                <description>Write Transfer Active
This status indicates whether a write transfer is active for
SD/eMMC mode.
Values:
- 0x0 (INACTIVE): No valid data
- 0x1 (ACTIVE): Transferring data</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_XFER_ACTIVE</name>
                <description>Read Transfer Active
This bit indicates whether a read transfer is active for
SD/eMMC mode.
Values:
- 0x0 (INACTIVE): No valid data
- 0x1 (ACTIVE): Transferring data</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUF_WR_ENABLE</name>
                <description>Buffer Write Enable
This bit is used for non-DMA transfers. This bit is set if space
is available for writing data.
Values:
- 0x0 (DISABLED): Write disable
- 0x1 (ENABLED): Write enable</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUF_RD_ENABLE</name>
                <description>Buffer Read Enable
This bit is used for non-DMA transfers. This bit is set if valid
data exists in the Host buffer.
Values:
- 0x0 (DISABLED): Read disable
- 0x1 (ENABLED): Read enable</description>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CARD_INSERTED</name>
                <description>Card Inserted
This bit indicates whether a card has been inserted. The
Host Controller debounces this signal so that Host Driver
need not wait for it to stabilize.
Values:
- 0x0 (FALSE): Reset, Debouncing, or No card
- 0x1 (TRUE): Card Inserted</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CARD_STABLE</name>
                <description>Card Stable
This bit indicates the stability of the Card Detect Pin Level. A
card is not detected if this bit is set to 1 and the value of the
CARD_INSERTED bit is 0.
Values:
- 0x0 (FALSE): Reset or Debouncing
- 0x1 (TRUE): No Card or Inserted</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CARD_DETECT_PIN_LEVEL</name>
                <description>Card Detect Pin Level
This bit reflects the inverse synchronized value of the
card_detect_n signal.
Values:
- 0x0 (FALSE): No card present
- 0x1 (TRUE): Card Present</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_PROTECT_SW_LVL</name>
                <description>Write Protect Switch Pin Level
This bit is supported only for memory and combo cards. This
bit reflects the synchronized value of the card_write_prot
signal.
Values:
- 0x0 (FALSE): Write protected
- 0x1 (TRUE): Write enabled</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DAT_3_0</name>
                <description>DAT[3:0] Line Signal Level
This bit is used to check the DAT line level to recover from
errors and for debugging. These bits reflect the value of the
sd_dat_in (lower nibble) signal.</description>
                <bitRange>[23:20]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_LINE_LVL</name>
                <description>Command-Line Signal Level
This bit is used to check the CMD line level to recover from
errors and for debugging. These bits reflect the value of the
sd_cmd_in signal.</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HOST_REG_VOL</name>
                <description>Host Regulator Voltage Stable
This bit is used to check whether the host regulator voltage is
stable for switching the voltage of UHS-I mode. This bit
reflects the synchronized value of the host_reg_vol_stable
signal.
Values:
- 0x0 (FALSE): Host Regulator Voltage is not stable
- 0x1 (TRUE): Host Regulator Voltage is stable</description>
                <bitRange>[25:25]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_ISSU_ERR</name>
                <description>Command Not Issued by Error
This bit is set if a command cannot be issued after setting
the command register due to an error except the Auto
CMD12 error.
Values:
- 0x0 (FALSE): No error for issuing a command
- 0x1 (TRUE): Command cannot be issued</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SUB_CMD_STAT</name>
                <description>Sub Command Status
This bit is used to distinguish between a main command and
a sub command status.
Values:
- 0x0 (FALSE): Main Command Status
- 0x1 (TRUE): Sub Command Status</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOST_CTRL1_R</name>
            <description>Host Control 1 Register</description>
            <addressOffset>0x28</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>LED_CTRL</name>
                <description>LED Control
This bit is used to caution the user not to remove the card
while the SD card is being accessed. The value is reflected
on the led_ctrl ouput.
Values:
- 0x0 (OFF): LED off
- 0x1 (ON): LED on</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DAT_XFER_WIDTH</name>
                <description>Data Transfer Width
For SD/eMMC mode,this bit selects the data transfer width of
the Host Controller. The Host Driver sets it to match the data
width of the SD/eMMC card.
Values:
- 0x1 (FOUR_BIT): 4-bit mode
- 0x0 (ONE_BIT): 1-bit mode</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HIGH_SPEED_EN</name>
                <description>High Speed Enable (SD/eMMC Mode only)
Before setting this bit, the Host Driver checks the High Speed
Support in the Capabilities register.
Note: SDHC always outputs the sd_cmd_out and
sd_dat_out lines at the rising edge of card clock
irrespective of this bit.
Values:
- 0x1 (HIGH_SPEED): High Speed mode
- 0x0 (NORMAL_SPEED): Normal Speed mode</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DMA_SEL</name>
                <description>N/A</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EXT_DAT_XFER</name>
                <description>Extended Data Transfer Width
This bit controls 8-bit bus width mode of embedded device.
Values:
- 0x1 (EIGHT_BIT): 8-bit Bus Width
- 0x0 (DEFAULT): Bus Width is selected by the Data
Transfer Width</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_DETECT_TEST_LVL</name>
                <description>Card Detect Test Level
This bit is enabled while the Card Detect Signal Selection is
set to 1 and it indicates whether a card inserted or not.
Values:
- 0x1 (CARD_INSERTED): Card Inserted
- 0x0 (No_CARD): No Card</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_DETECT_SIG_SEL</name>
                <description>Card Detect Signal Selection
This bit selects a source for card detection. When the source
for the card detection is switched, the interrupt must be
disabled during the switching period.
Values:
- 0x1 (CARD_DT_TEST_LEVEL): Card Detect Test Level
is selected (for test purpose)
- 0x0 (card_detect_n): card_detect_n signal is
selected (for normal use)</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_CTRL_R</name>
            <description>Power Control Register</description>
            <addressOffset>0x29</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>SD_BUS_PWR_VDD1</name>
                <description>SD Bus Power for VDD1
This bit enables VDD1 power of the card. This setting is
available on the card_if_pwr_en output so that it
can be used to control the VDD1 power supply of the card.
Before setting this bit, the SD Host Driver sets the SD Bus
Voltage Select bit. If the Host Controller detects a No Card
state, this bit is cleared.
In SD mode, if this bit is cleared, the Host Controller stops
the SD Clock by clearing the SD_CLK_IN bit in the
CLK_CTRL_R register.
Values:
- 0x0 (OFF): Power off
- 0x1 (ON): Power on</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SD_BUS_VOL_VDD1</name>
                <description>These bits are NON-operational (they can be written and read but they have no effect).  In a generic HCI host these would select the card supply voltage.  But, for the applications targeted for this block it is assumed that the card supply voltage is always fixed at the board level.  If for some reason there is a variable power supply then that can be managed through normal GPIO programming separately.</description>
                <bitRange>[3:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BGAP_CTRL_R</name>
            <description>Block Gap Control Register</description>
            <addressOffset>0x2A</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>STOP_BG_REQ</name>
                <description>Stop At Block Gap Request
This bit is used to stop executing read and write transactions
at the next block gap for non-DMA, SDMA, and ADMA
transfers.
Values:
- 0x0 (XFER): Transfer
- 0x1 (STOP): Stop</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONTINUE_REQ</name>
                <description>Continue Request
This bit is used to restart the transaction, which was stopped
using the Stop At Block Gap Request. The Host Controller
automatically clears this bit when the transaction restarts. If
stop at block gap request is set to 1, any write to this bit is
ignored.
Values:
- 0x0 (NO_AFFECT): No Affect
- 0x1 (RESTART): Restart</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_WAIT_CTRL</name>
                <description>N/A</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_AT_BGAP</name>
                <description>Interrupt At Block Gap
This bit is valid only in the 4-bit mode of an SDIO card and is
used to select a sample point in the interrupt cycle. Setting to
1 enables interrupt detection at the block gap for a multiple
block transfer.
Values:
- 0x0 (DISABLE): Disabled
- 0x1 (ENABLE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WUP_CTRL_R</name>
            <description>Wakeup Control Register</description>
            <addressOffset>0x2B</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>WUP_CARD_INT</name>
                <description>Wakeup Event Enable on SDIO Card Interrupt (through DAT[1]).
This bit enables wakeup event through an SDIO Card Interrupt
assertion in the Normal Interrupt Status register. This bit can
be set to 1 if FN_WUS (Wake Up Support) in CIS is set to 1.
Values:
- 0x0 (DISABLED): Disable
- 0x1 (ENABLED): Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WUP_CARD_INSERT</name>
                <description>Wakeup Event Enable on SD Card Insertion
This bit enables wakeup event through Card Insertion
assertion in the Normal Interrupt Status register. FN_WUS
(Wake Up Support) in CIS does not affect this bit.
Values:
- 0x0 (DISABLED): Disable
- 0x1 (ENABLED): Enable</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WUP_CARD_REMOVAL</name>
                <description>Wakeup Event Enable on SD Card Removal
This bit enables wakeup event through Card Removal
assertion in the Normal Interrupt Status register. For the
SDIO card, Wake Up Support (FN_WUS) in the Card
Information Structure (CIS) register does not affect this bit.
Values:
- 0x0 (DISABLED): Disable
- 0x1 (ENABLED): Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLK_CTRL_R</name>
            <description>Clock Control Register</description>
            <addressOffset>0x2C</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFEF</resetMask>
            <fields>
              <field>
                <name>INTERNAL_CLK_EN</name>
                <description>Internal Clock Enable
This bit is set to 0 when the Host Driver is not using the Host
Controller or the Host Controller awaits a wakeup interrupt.
The Host Controller must stop its internal clock to enter a
very low power state. Certain registers are not accessible when this bit is off.  So, to be safe turn it on for any register access.
Values:
- 0x0 (FALSE): Stop
- 0x1 (TRUE): Oscillate</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INTERNAL_CLK_STABLE</name>
                <description>Internal Clock Stable
This bit enables the Host Driver to check the clock stability
twice after the Internal Clock Enable bit is set and after the
PLL Enable bit is set. This bit reflects the synchronized
value of the Internal Clock Stable signal after the Internal Clock
Enable bit is set to 1 and also reflects the synchronized
value of the Card Clock Stable signal after the PLL Enable bit is
set to 1.
Values:
- 0x0 (FALSE): Not Ready
- 0x1 (TRUE): Ready</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SD_CLK_EN</name>
                <description>SD/eMMC Clock Enable
This bit stops the clk_card output when set to 0. The
SDCLK Frequency Select bit can be changed when
this bit is set to 0.
Values:
- 0x0 (FALSE): Disable providing clk_card
- 0x1 (TRUE): Enable providing clk_card</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PLL_ENABLE</name>
                <description>PLL Enable
This bit is used to activate the PLL (applicable when Host
Version 4 Enable = 1).
Values:
- 0x0 (FALSE): PLL is in low power mode
- 0x1 (TRUE): PLL is enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLK_GEN_SELECT</name>
                <description>Clock Generator Select
This bit is used to select the clock generator mode in
SDCLK Frequency Select.
Values:
- 0x0 (FALSE): Divided Clock Mode
- 0x1 (TRUE): Programmable Clock Mode</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>UPPER_FREQ_SEL</name>
                <description>These bits specify the upper 2 bits of 10-bit SDCLK
Frequency Select control.</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FREQ_SEL</name>
                <description>SDCLK Frequency Select
These bits are used to select the frequency of the SDCLK
signal.
10-bit Divided Clock Mode:
- 0x3FF - 1/2046 Divided clock
- ..........
- N - 1/2N Divided Clock
- ..........
- 0x002 - 1/4 Divided Clock
- 0x001 - 1/2 Divided Clock
- 0x000 - Base clock (10MHz - 255 MHz)</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TOUT_CTRL_R</name>
            <description>Timeout Control Register</description>
            <addressOffset>0x2E</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>TOUT_CNT</name>
                <description>N/A</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
