RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_02.svd
          <register>
            <name>FORCE_AUTO_CMD_STAT_R</name>
            <description>Force Event Register for Auto CMD Error Status register</description>
            <addressOffset>0x50</addressOffset>
            <size>16</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xBF</resetMask>
            <fields>
              <field>
                <name>FORCE_AUTO_CMD12_NOT_EXEC</name>
                <description>Force Event for Auto CMD12 Not Executed
Values:
- 0x1 (TRUE): Auto CMD12 Not Executed Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[0:0]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_TOUT_ERR</name>
                <description>Force Event for Auto CMD Timeout Error
Values:
- 0x1 (TRUE): Auto CMD Timeout Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[1:1]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_CRC_ERR</name>
                <description>Force Event for Auto CMD CRC Error
Values:
- 0x1 (TRUE): Auto CMD CRC Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[2:2]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_EBIT_ERR</name>
                <description>Force Event for Auto CMD End Bit Error
Values:
- 0x1 (TRUE): Auto CMD End Bit Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[3:3]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_IDX_ERR</name>
                <description>Force Event for Auto CMD Index Error
Values:
- 0x1 (TRUE): Auto CMD Index Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[4:4]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_RESP_ERR</name>
                <description>Force Event for Auto CMD Response Error
Values:
- 0x1 (TRUE): Auto CMD Response Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[5:5]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_CMD_NOT_ISSUED_AUTO_CMD12</name>
                <description>Force Event for Command Not Issued By Auto CMD12 Error
Values:
- 0x1 (TRUE): Command Not Issued By Auto CMD12 Error
Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCE_ERROR_INT_STAT_R</name>
            <description>Force Event Register for Error Interrupt Status</description>
            <addressOffset>0x52</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FORCE_CMD_TOUT_ERR</name>
                <description>Force Event for Command Timeout Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command Timeout Error Status is set</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CMD_CRC_ERR</name>
                <description>Force Event for Command CRC Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command CRC Error Status is set</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CMD_END_BIT_ERR</name>
                <description>Force Event for Command End Bit Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command End Bit Error Status is set</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CMD_IDX_ERR</name>
                <description>Force Event for Command Index Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command Index Error Status is set</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DATA_TOUT_ERR</name>
                <description>Force Event for Data Timeout Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Data Timeout Error Status is set</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DATA_CRC_ERR</name>
                <description>Force Event for Data CRC Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Data CRC Error Status is set</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DATA_END_BIT_ERR</name>
                <description>Force Event for Data End Bit Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Data End Bit Error Status is set</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CUR_LMT_ERR</name>
                <description>Force Event for Current Limit Error
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Current Limit Error Status is set</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_ERR</name>
                <description>Force Event for Auto CMD Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Auto CMD Error Status is set</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_ADMA_ERR</name>
                <description>Force Event for ADMA Error
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): ADMA Error Status is set</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_TUNING_ERR</name>
                <description>Force Event for Tuning Error (UHS-I Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Tuning Error Status is set</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_RESP_ERR</name>
                <description>Force Event for Response Error (SD Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Response Error Status is set</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_BOOT_ACK_ERR</name>
                <description>Force Event for Boot Ack error
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Boot ack Error Status is set</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_VENDOR_ERR1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_VENDOR_ERR2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_VENDOR_ERR3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMA_ERR_STAT_R</name>
            <description>ADMA Error Status Register</description>
            <addressOffset>0x54</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>ADMA_ERR_STATES</name>
                <description>ADMA Error States
These bits indicate the state of ADMA when an error occurs
during ADMA data transfer.
Values:
- 0x0 (ST_STOP): Stop DMA - SYS_ADR register points to
a location next to the error descriptor
- 0x1 (ST_FDS): Fetch Descriptor - SYS_ADR register
points to the error descriptor
- 0x2 (UNUSED): Never set this state
- 0x3 (ST_TFR): Transfer Data - SYS_ADR register points
to a location next to the error descriptor</description>
                <bitRange>[1:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADMA_LEN_ERR</name>
                <description>ADMA Length Mismatch Error States
This error occurs in the following instances:
- While the Block Count Enable is being set, the total data
length specified by the Descriptor table is different from
that specified by the Block Count and Block Length
- When the total data length cannot be divided by the block
length
Values:
- 0x0 (NO_ERR): No Error
- 0x1 (ERROR): Error</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMA_SA_LOW_R</name>
            <description>ADMA System Address Register - Low</description>
            <addressOffset>0x58</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADMA_SA_LOW</name>
                <description>ADMA System Address
These bits indicate the lower 32 bits of the ADMA system
address.
- SDMA: If Host Version 4 Enable is set to 1, this register
stores the system address of the data location
- ADMA2: This register stores the byte address of the
executing command of the descriptor table
- ADMA3: This register is set by ADMA3. ADMA2
increments the address of this register that points to the
next line, every time a Descriptor line is fetched.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMA_ID_LOW_R</name>
            <description>ADMA3 Integrated Descriptor Address Register - Low</description>
            <addressOffset>0x78</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADMA_ID_LOW</name>
                <description>ADMA Integrated Descriptor Address
These bits indicate the lower 32-bit of the ADMA Integrated
Descriptor address. The start address of Integrated
Descriptor is set to these register bits. The ADMA3 fetches
one Descriptor Address and increments these bits to indicate
the next Descriptor address.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOST_CNTRL_VERS_R</name>
            <description>Host Controller Version</description>
            <addressOffset>0xFE</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x5</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SPEC_VERSION_NUM</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>VENDOR_VERSION_NUM</name>
                <description>N/A</description>
                <bitRange>[15:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQVER</name>
            <description>Command Queuing Version register</description>
            <addressOffset>0x180</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x510</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>EMMC_VER_SUFFIX</name>
                <description>This bit indicates the eMMC version suffix (2nd digit right of
decimal point) in BCD format.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>EMMC_VER_MINOR</name>
                <description>This bit indicates the eMMC minor version (1st digit right of
decimal point) in BCD format.</description>
                <bitRange>[7:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>EMMC_VER_MAJOR</name>
                <description>This bit indicates the eMMC major version (1st digit left of
decimal point) in BCD format.</description>
                <bitRange>[11:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCAP</name>
            <description>Command Queuing Capabilities register</description>
            <addressOffset>0x184</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x30C8</resetValue>
            <resetMask>0x1000F3FF</resetMask>
            <fields>
              <field>
                <name>ITCFVAL</name>
                <description>Internal Timer Clock Frequency Value (ITCFVAL)
This field scales the frequency of the timer clock provided by
ITCFMUL. The Final clock frequency of actual timer clock is
calculated as ITCFVAL* ITCFMUL.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ITCFMUL</name>
                <description>N/A</description>
                <bitRange>[15:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CRYPTO_SUPPORT</name>
                <description>Crypto Support
This bit indicates whether the Host Controller supports
cryptographic operations.
Values:
- 0x0 (FALSE): Crypto not Supported
- 0x1 (TRUE): Crypto Supported</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCFG</name>
            <description>Command Queuing Configuration register</description>
            <addressOffset>0x188</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1103</resetMask>
            <fields>
              <field>
                <name>CQ_EN</name>
                <description>Enable command queuing engine (CQE).
When CQE is disable, the software controls the eMMC bus
using the registers between the addresses 0x000 to 0x1FF.
Before the software writes to this bit, the software verifies
that the eMMC host controller is in idle state and there are no
ongoing commands or data transfers. When software wants
to exit command queuing mode, it clears all previous tasks (if
any) before setting this bit to 0.
Values:
- 0x1 (CQE_ENABLE): Enable command queuing
- 0x0 (CQE_DISABLE): Disable command queuing</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CR_GENERAL_EN</name>
                <description>N/A</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TASK_DESC_SIZE</name>
                <description>Bit Value Description
This bit indicates the size of task descriptor used in host
memory. This bit can only be configured when Command
Queuing Enable bit is 0 (command queuing is disabled).
Values:
- 0x1 (TASK_DESC_128b): Task descriptor size is 128 bits
- 0x0 (TASK_DESC_64b): Task descriptor size is 64 bits</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DCMD_EN</name>
                <description>This bit indicates to the hardware whether the Task
Descriptor in slot #31 of the TDL is a data transfer descriptor
or a direct-command descriptor. CQE uses this bit when a
task is issued in slot #31, to determine how to decode the
Task Descriptor.
Values:
- 0x1 (SLOT31_DCMD_ENABLE): Task descriptor in slot
#31 is a DCMD Task Descriptor
- 0x0 (SLOT31_DCMD_DISABLE): Task descriptor in slot
#31 is a data Transfer Task Descriptor</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCTL</name>
            <description>Command Queuing Control register</description>
            <addressOffset>0x18C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x101</resetMask>
            <fields>
              <field>
                <name>HALT</name>
                <description>Halt request and resume
Values:
- 0x1 (HALT_CQE): Software writes 1 to this bit when it
wants to acquire software control over the eMMC bus and
to disable CQE from issuing command on the bus.
For example, issuing a Discard Task command
(CMDQ_TASK_MGMT). When the software writes 1, CQE
completes the ongoing task (if any in progress). After the
task is completed and the CQE is in idle state, CQE does not
issue new commands and indicates to the software by
setting this bit to 1. The software can poll on this bit until it is
set to 1 and only then send commands on the eMMC bus.
- 0x0 (RESUME_CQE): Software writes 0 to this bit to exit
from the halt state and resume CQE activity.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLR_ALL_TASKS</name>
                <description>Clear all tasks
This bit can only be written when the controller is halted. This
bit does not clear tasks in the device. The software has to
use the CMDQ_TASK_MGMT command to clear device's
queue.
Values:
- 0x1 (CLEAR_ALL_TASKS): Clears all the tasks in the
controller
- 0x0 (NO_EFFECT): Programming 0 has no effect</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQIS</name>
            <description>Command Queuing Interrupt Status register</description>
            <addressOffset>0x190</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>HAC</name>
                <description>Halt complete interrupt
This status bit is asserted (only if CQISE.HAC_STE=1) when
halt bit in the CQCTL register transitions from 0 to 1
indicating that the host controller has completed its current
ongoing task and has entered halt state. A value of 1 clears
this status bit.
Values:
- 0x1 (SET): HAC Interrupt is set
- 0x0 (NOTSET): HAC Interrupt is not set</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCC</name>
                <description>Task complete interrupt
This status bit is asserted (if CQISE.TCC_STE=1) when at
least one of the following conditions are met:
- A task is completed and the INT bit is set in its Task
Descriptor
- Interrupt caused by Interrupt Coalescing logic due to
timeout
- Interrupt Coalescing logic reached the configured
threshold
A value of 1 clears this status bit
Values:
- 0x1 (SET): TCC Interrupt is set
- 0x0 (NOTSET): TCC Interrupt is not set</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RED</name>
                <description>Response error detected interrupt
This status bit is asserted (if CQISE.RED_STE=1) when a
response is received with an error bit set in the device status
field. Configure the CQRMEM register to identify device
status bit fields that may trigger an interrupt and that are
masked. A value of 1 clears this status bit.
Values:
- 0x1 (SET): RED Interrupt is set
- 0x0 (NOTSET): RED Interrupt is not set</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCL</name>
                <description>Task cleared interrupt
This status bit is asserted (if CQISE.TCL_STE=1) when a
task clear operation is completed by CQE. The completed
task clear operation is either an individual task clear (by
writing CQTCLR) or clearing of all tasks (by writing CQCTL).
A value of 1 clears this status bit.
Values:
- 0x1 (SET): TCL Interrupt is set
- 0x0 (NOTSET): TCL Interrupt is not set</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCE</name>
                <description>N/A</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICCE</name>
                <description>N/A</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
